tutorials/CFD/27SmagorinskyHyperreduction/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2106                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "500";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
11644
(
1.4087528e-06
1.953103e-06
2.7424413e-06
3.6328214e-06
4.5586139e-06
5.5005381e-06
6.4380578e-06
7.3507038e-06
...
)
;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    down
    {
        type            symmetryPlane;
    }
    up
    {
        type            symmetryPlane;
    }
    sides
    {
        type            slip;
    }
    cylinder1
    {
        type            fixedValue;
        value           uniform 0;
    }
}


// ************************************************************************* //
