tutorials/CFD/27SmagorinskyHyperreduction/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2106                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "500";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
11644
(
0.061646248
0.062169409
0.063200271
0.064748816
0.0668144
0.069397921
0.072494012
0.076090344
...
)
;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    down
    {
        type            symmetryPlane;
    }
    up
    {
        type            symmetryPlane;
    }
    sides
    {
        type            zeroGradient;
    }
    cylinder1
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
